# question on the given data

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\hp\Desktop\CAR DETAILS FROM CAR DEKHO.csv")
df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [49]:
df.columns

Index(['name', 'year', 'selling_price', 'km_driven', 'fuel', 'seller_type',
       'transmission', 'owner'],
      dtype='object')

In [50]:
#1: name the car which is having the selling price more than 600000.
df[df["selling_price"]>600000]["name"]

8                 Hyundai Creta 1.6 VTVT S
12         Toyota Corolla Altis 1.8 VL CVT
21                Hyundai Creta 1.6 VTVT S
25         Toyota Corolla Altis 1.8 VL CVT
27             Hyundai Venue SX Opt Diesel
                       ...
4311               Toyota Camry Hybrid 2.5
4312                 Maruti Ertiga 1.5 VDI
4313    Ford Endeavour 2.2 Titanium AT 4X2
4332          Mahindra Scorpio S2 7 Seater
4338      Hyundai Creta 1.6 CRDi SX Option
Name: name, Length: 1057, dtype: object

In [51]:
#2 name the car having manual transmission and also find how much km its driven.

df[df['transmission']=='Manual'][['name','km_driven']]

                                     name  km_driven
0                           Maruti 800 AC      70000
1                Maruti Wagon R LXI Minor      50000
2                    Hyundai Verna 1.6 SX     100000
3                  Datsun RediGO T Option      46000
4                   Honda Amaze VX i-DTEC     141000
...                                   ...        ...
4335  Hyundai i20 Magna 1.4 CRDi (Diesel)      80000
4336           Hyundai i20 Magna 1.4 CRDi      80000
4337                  Maruti 800 AC BSIII      83000
4338     Hyundai Creta 1.6 CRDi SX Option      90000
4339                     Renault KWID RXT      40000

[3892 rows x 2 columns]

In [52]:
#3name the list of the car having sold by first owner.


df[df['owner']=='Second Owner']['name']

4                     Honda Amaze VX i-DTEC
7                  Tata Indigo Grand Petrol
17                    Honda Amaze VX i-DTEC
20                 Tata Indigo Grand Petrol
28        Chevrolet Enjoy TCDi LTZ 7 Seater
                       ...
4330         Tata Indica Vista Aqua 1.4 TDI
4333                        Maruti Ritz VDi
4335    Hyundai i20 Magna 1.4 CRDi (Diesel)
4336             Hyundai i20 Magna 1.4 CRDi
4337                    Maruti 800 AC BSIII
Name: name, Length: 1106, dtype: object

In [53]:
#4 name the list of the car having selling price more than 10lac but manufacturring year will be 2010
a=df[df['selling_price']>1000000][['name','year']]
a[a["year"]==2010]["name"]

163                    Jaguar XJ 5.0 L V8 Supercharged
2685                          Audi Q5 2.0 TFSI Quattro
3782                        Toyota Fortuner 3.0 Diesel
3875    Land Rover Range Rover 4.4 Diesel LWB Vogue SE
Name: name, dtype: object

In [54]:
#5 find the most expensive car.
a=df["selling_price"].max()
df[df["selling_price"]==a]["name"]

3872    Audi RS7 2015-2019 Sportback Performance
Name: name, dtype: object

In [55]:
#6 find the cheapest car.
df[df["selling_price"]==df["selling_price"].min()]["name"]

2662    Ford Ikon 1.6 ZXI NXt
Name: name, dtype: object

In [56]:
#7 find the car which is max driven
df[df["km_driven"]==df["km_driven"].max()]["name"]

1243    Maruti Swift VXI BSIII
Name: name, dtype: object

In [57]:
#8 find the car which is min driven
df[df["km_driven"]==df["km_driven"].min()]["name"]

1312    Mahindra Quanto C6
Name: name, dtype: object

In [8]:
#9 what is the fule type and transmission of "Maruti car".
df[df["name"]=="Maruti 800 AC"][["name","fuel","transmission"]]

               name    fuel transmission
0     Maruti 800 AC  Petrol       Manual
13    Maruti 800 AC  Petrol       Manual
175   Maruti 800 AC  Petrol       Manual
259   Maruti 800 AC  Petrol       Manual
372   Maruti 800 AC  Petrol       Manual
402   Maruti 800 AC  Petrol       Manual
669   Maruti 800 AC  Petrol       Manual
1284  Maruti 800 AC  Petrol       Manual
1446  Maruti 800 AC  Petrol       Manual
1726  Maruti 800 AC  Petrol       Manual
3181  Maruti 800 AC  Petrol       Manual
3215  Maruti 800 AC  Petrol       Manual
3217  Maruti 800 AC  Petrol       Manual
3259  Maruti 800 AC  Petrol       Manual
3285  Maruti 800 AC  Petrol       Manual
3314  Maruti 800 AC  Petrol       Manual
3503  Maruti 800 AC  Petrol       Manual
3630  Maruti 800 AC  Petrol       Manual
3652  Maruti 800 AC  Petrol       Manual
3740  Maruti 800 AC  Petrol       Manual
3856  Maruti 800 AC  Petrol       Manual
4088  Maruti 800 AC  Petrol       Manual
4323  Maruti 800 AC  Petrol       Manual

In [10]:
#10 what is the selling price of 'Toyota corolla Altis 1.8 VL CVT' car.
df[df['name']=='Toyota Corolla Altis 1.8 VL CVT'][["name",'selling_price']]

                               name  selling_price
12  Toyota Corolla Altis 1.8 VL CVT        1650000
25  Toyota Corolla Altis 1.8 VL CVT        1650000